using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace NitouAssistant.data;

public static class MapMetaData
{
    public static readonly string[] VersionOptions = {
        "未选择版本", "暗影之逆焰", "晓月之终途", "金曦之遗辉"
    };

    public static readonly Dictionary<string, string> VersionEng = new()
    {
        { "暗影之逆焰", "Shadowbringers" },
        { "晓月之终途", "Endwalker" },
        { "金曦之遗辉", "Dawntrail" }
    };

    public static readonly Dictionary<string, string[]> VersionToMaps = new()
    {
        { "暗影之逆焰", new[] { "雷克兰德", "珂露西亚岛", "安穆艾兰", "伊尔美格", "拉凯提卡大森林", "黑风海" } },
        { "晓月之终途", new[] { "迷津", "萨维奈岛", "加雷马", "叹息海", "天外天垓", "厄尔庇斯" } },
        { "金曦之遗辉", new[] { "奥阔帕恰山", "克扎玛乌卡湿地", "亚克特尔树海", "夏劳尼荒野", "遗产之地", "活着的记忆" } }
    };

    public static class TpPoints
    {
        public static readonly Dictionary<string, string> AetheryteList = new()
        {
            { "雷克兰德", "乔布要塞" },
            { "珂露西亚岛", "图姆拉村" },
            { "安穆艾兰", "络尾聚落" },
            { "伊尔美格", "群花馆" },
            { "拉凯提卡大森林", "法诺村" },
            { "黑风海", "鳍人潮池" },

            { "迷津", "公堂保管院" },
            { "萨维奈岛", "新港" },
            { "加雷马", "第三站" },
            { "叹息海", "泪湾" },
            { "天外天垓", "半途终旅" },
            { "厄尔庇斯", "十二奇园" },

            { "奥阔帕恰山", "瓦丘恩佩洛" },
            { "克扎玛乌卡湿地", "哈努聚落" },
            { "亚克特尔树海", "红豹村" },
            { "夏劳尼荒野", "胡萨塔伊驿镇" },
            { "遗产之地", "亚斯拉尼站" },
            { "活着的记忆", "地场节点·忆" }
        };
    }

    public static class MapTerritoryType
    {
        public static readonly Dictionary<string, int> MapID = new()
        {
            { "雷克兰德", 813 },
            { "珂露西亚岛", 814 },
            { "安穆艾兰", 815 },
            { "伊尔美格", 816 },
            { "拉凯提卡大森林", 817 },
            { "黑风海", 818 },

            { "迷津", 956 },
            { "萨维奈岛", 957 },
            { "加雷马", 958 },
            { "叹息海", 969 },
            { "天外天垓", 960 },
            { "厄尔庇斯", 961 },

            { "奥阔帕恰山", 1187 },
            { "克扎玛乌卡湿地", 1188 },
            { "亚克特尔树海", 1189 },
            { "夏劳尼荒野", 1190 },
            { "遗产之地", 1191 },
            { "活着的记忆", 1192 }
        };
    }

    internal static class RankASpawnPoints
    {
        public static readonly Dictionary<string, List<(float X, float Y, float Z)>> Points = new()
        {
            ["雷克兰德"] = new List<(float, float, float)>
            {
                (754.473f, 80.849f, -459.455f),
                (684.676f, 25.555f, -281.994f),
                (712.934f, 11.802f, 274.303f),
                (686.221f, 2.808f, 536.997f),
                (256.653f, 15.429f, 784.744f),
                (302.601f, 6.232f, 463.468f),
                (463.535f, 2.686f, 59.291f),
                (401.122f, 118.596f, -102.825f),
                (307.545f, 112.506f, -301.806f),
                (199.911f, 10.081f, 115.652f),
                (84.108f, -1.856f, 405.973f),
                (-161.368f, -0.701f, 78.520f),
                (86.076f, 110.247f, -452.914f),
                (-96.182f, 93.535f, -583.316f),
                (-485.433f, 71.990f, -445.207f),
                (-508.992f, 13.474f, -217.035f),
                (-685.484f, 68.922f, 59.471f),
                (-388.776f, -1.595f, 150.046f),
            },
            ["伊尔美格"] = new List<(float, float, float)>
            {
                (-119.335f, 3.797f, 287.651f),
                (63.689f, 1.820f, 369.742f),
                (152.197f, 0.513f, 560.782f),
                (160.948f, 0.300f, 789.040f),
                (-86.759f, 30.309f, 671.945f),
                (-396.082f, 71.037f, 629.818f),
                (-590.673f, 64.823f, 453.235f),
                (-685.050f, 41.100f, 270.913f),
                (-694.102f, 35.266f, 67.329f),
                (-534.819f, 10.422f, -56.095f),
                (-514.187f, 38.033f, -282.653f),
                (-67.353f, 53.972f, -648.646f),
                (205.812f, 75.959f, -719.886f),
                (387.726f, 89.459f, -803.749f),
                (613.640f, 107.644f, -709.831f),
                (508.028f, 92.427f, -392.585f),
                (286.382f, 39.793f, -119.868f),
            },
            ["拉凯提卡大森林"] = new List<(float, float, float)>
            {
                (-241.854f, 12.023f, 132.950f),
                (-327.450f, 5.850f, 47.198f),
                (-595.233f, 19.743f, -143.584f),
                (-574.499f, 4.989f, 120.090f),
                (-321.193f, 17.587f, 434.478f),
                (-182.186f, 10.004f, 679.866f),
                (-477.348f, -0.300f, 716.760f),
                (-645.663f, 5.804f, 658.512f),
                (204.744f, -10.300f, 445.965f),
                (244.859f, 14.185f, 138.760f),
                (407.070f, 32.590f, 225.847f),
                (595.688f, 22.621f, 64.755f),
                (247.574f, 5.015f, -319.225f),
                (19.411f, -4.548f, -386.891f),
                (48.909f, -20.000f, -535.209f),
            },
            ["安穆艾兰"] = new List<(float, float, float)>
            {
                (363.202f, -31.056f, -458.606f),
                (472.292f, -38.977f, -384.300f),
                (370.888f, -17.879f, -66.297f),
                (613.945f, -27.360f, -0.773f),
                (354.908f, -36.962f, 224.740f),
                (577.467f, -105.583f, 616.099f),
                (443.265f, -89.199f, 682.518f),
                (-76.876f, -51.867f, 750.769f),
                (78.541f, -111.059f, 414.453f),
                (-90.166f, -61.129f, 365.379f),
                (-217.925f, -63.350f, 502.149f),
                (-115.057f, -32.832f, 167.116f),
                (-259.312f, 6.608f, 130.518f),
                (-495.819f, 25.822f, -106.336f),
                (-109.135f, 31.628f, -261.988f),
                (-237.916f, 37.419f, -565.819f),
                (-556.745f, -1.076f, -481.064f),
            },
            ["珂露西亚岛"] = new List<(float, float, float)>
            {
                (649.284f, 41.508f, 141.660f),
                (429.028f, 11.860f, 425.737f),
                (266.377f, 35.890f, 144.420f),
                (162.261f, 19.274f, 415.353f),
                (-31.480f, 15.927f, 478.721f),
                (-322.243f, 52.449f, 143.570f),
                (-627.123f, 51.683f, 208.165f),
                (-495.950f, 341.068f, -141.755f),
                (-331.144f, 364.698f, -289.573f),
                (-222.592f, 461.924f, -725.943f),
                (-93.801f, 411.098f, -547.249f),
                (17.247f, 353.448f, -373.576f),
                (171.125f, 329.761f, -505.890f),
                (495.878f, 287.611f, -96.980f),
                (266.452f, 302.271f, -111.377f),
                (78.974f, 337.892f, -190.924f),
                (-14.165f, 319.118f, 54.234f),
            },
            ["黑风海"] = new List<(float, float, float)>
            {
                (381.391f, 341.957f, 64.255f),
                (618.685f, 382.505f, 23.423f),
                (730.004f, 400.962f, -79.201f),
                (809.300f, 394.893f, -239.789f),
                (754.005f, 411.414f, -496.452f),
                (470.517f, 379.536f, -527.122f),
                (485.063f, 439.353f, -865.700f),
                (345.875f, 378.503f, -656.312f),
                (184.615f, 358.077f, -424.616f),
                (-26.701f, 424.301f, -686.536f),
                (-165.802f, 360.239f, -411.969f),
                (-285.676f, 384.310f, -556.151f),
                (-505.918f, 392.636f, -807.536f),
                (-656.229f, 400.075f, -662.178f),
                (-407.645f, 125.409f, -203.577f),
                (-305.033f, 277.017f, -57.824f),
                (163.433f, 279.683f, 160.662f),
            },


        };
    }
}
